package day06;
import java.util.Scanner;
import java.util.ArrayList;
import 
public class Ex10_Dictionary {

	public static void main(String[] args) {
		/*다음 기능을 갖는 프로그램을 작성하세요.
		 * -----------------
		 * 1. 단어 등록
		 * 2. 단어 수정
		 * 3. 단어 삭제
		 * 4. 단어 검색
		 * 5. 종료
		 * 메뉴 선택 : 1
		 * 단어 : apple
		 * 의미 : 사과, 회사명
		 * 단어가 등록되었습니다.
		 * ------------------
		 * 1. 단어 등록
		 * 2. 단어 수정
		 * 3. 단어 삭제
		 * 4. 단어 검색
		 * 5. 종료
		 * 메뉴 선택 : 1
		 * 단어 : apple
		 * 의미 : apple
		 * 이미 등록되었습니다.
		 * ------------------
		 * 1. 단어 등록
		 * 2. 단어 수정
		 * 3. 단어 삭제
		 * 4. 단어 검색
		 * 5. 종료
		 * 메뉴 선택 : 2
		 * 단어 : apple
		 * 의미 : 사과, 회사명(애플)
		 * 단어가 수정되었습니다.
		 * ------------------
		 * 1. 단어 등록
		 * 2. 단어 수정
		 * 3. 단어 삭제
		 * 4. 단어 검색
		 * 5. 종료
		 * 메뉴 선택 : 4
		 * 단어 : a
		 * apple:사과, 회사명(애플)
		 * ------------------
		 * 1. 단어 등록
		 * 2. 단어 수정
		 * 3. 단어 삭제
		 * 4. 단어 검색
		 * 5. 종료
		 * 메뉴 선택 : 3
		 * 단어 : apple
		 * 단어가 삭제되었습니다.
		 * ------------------
		 * */
		
		
	}

}
