# 장르를 추가
INSERT INTO GENRE VALUES
("어드벤처"),("SF"),("드라마"),("코미디"),("전쟁"),("액션"),("애니메이션"),("판타지"),("스릴러");
# 관람 등급을 추가
INSERT INTO MOVIE_RATINGS VALUES
("전체 관람가"),("12세 이상 관람가"),("15세 이상 관람가"),("청소년 관람 불가"),("제한 상영가");
# 국가 추가
INSERT INTO COUNTRY VALUES
("영국"),("미국"),("호주"),("한국"),("일본"),("중국");
# 지역 추가
INSERT INTO REGION VALUES
("서울"),("경기"),("인천"),("대전/충청"),("대구"),("부산/울산"),("경상"),("광주/전라/제주");
# 요금, 성인 : 15000원, 청소년 : 12000원, 조조 : 11000원
INSERT INTO FEE(FE_TYPE, FE_PRICE, FE_DATE) VALUES
("성인", "15000", "2025-03-01"),
("청소년", "12000", "2025-03-01"),
("조조", "11000", "2025-03-01");

# CGV 사이트를 참고하여 미키 17영화를 등록할 때 필요한 쿼리들을 작성하세요.

# 인물을 추가
INSERT INTO PERSON(PR_NAME, PR_BIRTH, PR_DETAIL, PR_CT_NAME)
VALUES
("봉준호","1969-09-14"," ","한국"),
("로버트 패틴슨","1986-05-13",
"국내에서는 [해리포터와 불의잔]에서 캐드릭 디고리 역을 맡아 가장 눈에 띄는 연기를 보였던 ‘로버트 패틴슨’은 1986년 생 영국 출신 배우이다.
못하는 스포츠가 없을 정도로 만능 스포츠맨인 그는 풋볼, 스키, 스노우보드 등 각종 스포츠 경기에 참가하여 취미 활동이라고는 생각할 수 없을 정도로 완벽한 실력을 선보여 주변인을 깜짝 놀라게 했다.
[트와일라잇]의 절대매력 뱀파이어 ‘에드워드’ 역으로 전세계 소녀 팬들의 사랑을 한 몸에 받은 그는19살때 [해리포터와 불의 잔]의 출연으로 영화 관계자들의 관심을 끌었다. 또한 음악적으로도 남다른 재능을 갖고 있어, 기타와 키보드 연주를 통해 음악에 대한 열정을 드러냈으며 영화 [트와일라잇]의 O.S.T.에도 참여하여 큰 이슈가 되기도 하였다. [트와일라잇] 단 한편으로 전세계 하이틴 스타로 군림한 그는 최근에는 연극 무대에 참여하는 등 다양한 방면으로 자신의 경력을 쌓고 있는 욕심 많은 연기자이다.",
"영국"),
("나오미 애키","1992-11-02"," ", "영국"),
("스티븐 연","1969-09-14",
"한국계 미국인 스티븐 연은 어린 시절 한국에서 살던 중 그의 나이 다섯 살, 가족들과 함께 미국으로 건너가 성장하게 되었다.
 대학 시절 심리학을 전공한 그는 우연히 연기를 접하게 되면서 배우로서의 꿈을 품게 된다.
 이후, 다양한 연극과 영화 작품 활동을 통해 탄탄한 연기력을 쌓는다.
 그러다 드라마 [워킹 데드]에 출연하면서 단숨에 할리우드 스타덤에 오른다.
 이후, 봉준호 감독의 <옥자>(2017), 이창동 감독의 <버닝>(2018) 등 세계적인 국내 명감독의 작품에서 개성 넘치는 캐릭터를 소화하며 한국 관객들에게도 뜨거운 사랑을 받았다."
,"미국"),
("토니 콜렛","1972-11-01","      ","호주"),
("마크 러팔로","1967-11-22","1968년 위스콘신 출생.
제2의 말론 브란도로 불리 우며, 브로드웨이를 사로잡은 마크 러팔로는 영화와, TV, 연극무대에서 활동하며 다방면의 재능을 보이고 있다. 어눌해 보이는 듯한 말투나, 삶을 체념한 듯한 행동의 이면에 악마적인 카리스마와 음울한 고독의 그림자를 드리우는 그는 <유 캔 카운트 온 미>를 통해 비뚫어진 삶, 고독한 방랑 인생의 이면에 존재하는 따뜻한 열정과 온기를 보여주며, 방랑자의 영혼을 읊조리는 듯한 음유시인의 모습으로 관객들을 사로잡고, 몬트리올 영화제 남우주연상을 수상의 영광을 안았다.",
"미국");
# 영화인 등록
INSERT INTO ACTOR(AT_POSITION, AT_PR_NUM)
 VALUES
 ("감독",1),("배우",2),("배우",3),("배우",4),("배우",5),("배우",6);
 


# 미키17 영화 정보를 추가, 제목, 상영시간, 개봉일, 내용, 상태, 관람 등급
INSERT INTO MOVIE(MV_TITLE, MV_TIME, MV_DATE, MV_CONTENT, MV_STATE,MV_MR_AGE)
VALUE
	("미키 17", 137, "2025-02-28","“당신은 몇 번째 미키입니까?”
친구 ‘티모’와 함께 차린 마카롱 가게가 쫄딱 망해 거액의 빚을 지고
못 갚으면 죽이겠다는 사채업자를 피해 지구를 떠나야 하는 ‘미키’.
기술이 없는 그는, 정치인 ‘마셜’의 얼음행성 개척단에서
위험한 일을 도맡고, 죽으면 다시 프린트되는 익스펜더블로 지원한다.
4년의 항해와 얼음행성 니플하임에 도착한 뒤에도 늘 ‘미키’를 지켜준 여자친구 ‘나샤’.
그와 함께, ‘미키’는 반복되는 죽음과 출력의 사이클에도 익숙해진다.
그러나 ‘미키 17’이 얼음행성의 생명체인 ‘크리퍼’와 만난 후 죽을 위기에서 돌아와 보니
이미 ‘미키 18’이 프린트되어 있다.
행성 당 1명만 허용된 익스펜더블이 둘이 된 ‘멀티플’ 상황
둘 중 하나는 죽어야 하는 현실 속에 걷잡을 수 없는 사건이 기다리고 있었으니…

“자알 죽고, 내일 만나”",
"상영중","15세 이상 관람가" );
# 영화 참여 등록
INSERT INTO MOVIE_ACTOR(MA_ROLE, MA_MV_NUM, MA_AT_NUM) VALUES
("감독",1,1),
("미키 반스",1,2),
("나샤 배릿지",1,3),
("티모",1,4),
("일파 마샬",1,5),
("케네스 마샬",1,6);

# 영화 장르 등록
INSERT INTO MOVIE_GENRE(MG_MV_NUM, MG_GR_NAME)VALUES
(1, "어드벤처"),(1, "SF"),(1, "드라마");

# 제작 국가 등록
INSERT INTO MOVIE_COUNTRY(MC_CT_NAME, MC_MV_NUM) VALUES("미국", 1);

#트레일러와 스틸컷 등록
INSERT INTO FILE(FI_NAME, FI_TYPE, FI_MV_NUM) VALUES
("미키17_1.JPG", "S", 1),
("미키17_2.JPG", "S", 1),
("미키17_3.JPG", "S", 1),
("미키17_1.MP4", "T", 1),
("미키17_2.MP4", "T", 1),
("미키17_3.MP4", "T", 1);

# 미키 17 강남 3/11 상영시간을 등록할 때 필요한 쿼리들을 작성
# 4관 13:50, 19:10,
# 1관 16:20
# 3관 09:00, 11:50
# 5관 10:10 

#극장 등록
INSERT INTO THEATER(TT_NAME, TT_ADDR, TT_COUNT, TT_RG_NAME)
VALUE("CGV강남", "서울특별시 강남구 강남대로 438 스타플렉스 4층~8층(역삼동)", 5, "서울");

#상영관 등록 : CGV강남 1관~5관
INSERT INTO SCREEN(SC_NAME,SC_SEAT,SC_TT_NUM) VALUES
("1관", 12, 1),("2관", 10, 1),("3관", 15, 1),("4관", 16, 1),("5관", 20, 1);

#상영관 좌석 등록
INSERT INTO SEAT(SE_NAME, SE_SC_NUM) VALUES
("A1",1),("A2",1),("A3",1),("A4",1),
("B1",1),("B2",1),("B3",1),("B4",1),
("C1",1),("C2",1),("C3",1),("C4",1),

("A1",2),("A2",2),("A3",2),("A4",2),("A5",2),
("B1",2),("B2",2),("B3",2),("B4",2),("B5",2),

("A1",3),("A2",3),("A3",3),
("B1",3),("B2",3),("B3",3),
("C1",3),("C2",3),("C3",3),
("D1",3),("D2",3),("D3",3),
("E1",3),("E2",3),("E3",3),

("A1",4),("A2",4),("A3",4),("A4",4),
("B1",4),("B2",4),("B3",4),("B4",4),
("C1",4),("C2",4),("C3",4),("C4",4),
("D1",4),("D2",4),("D3",4),("D4",4),

("A1",5),("A2",5),("A3",5),("A4",5),("A5",5),
("B1",5),("B2",5),("B3",5),("B4",5),("B5",5),
("C1",5),("C2",5),("C3",5),("C4",5),("C5",5),
("D1",5),("D2",5),("D3",5),("D4",5),("D5",5)
;

# 상영 시간 등록
INSERT INTO `SCHEDULE`(SD_DATE, SD_TIME, SD_POS_SEAT, SD_EARLY, SD_MV_NUM, SD_SC_NUM)
VALUES
("2025-03-11", "16:20", "12","N",1,1),
("2025-03-11", "09:00", "15","Y",1,3),
("2025-03-11", "11:50", "15","N",1,3),
("2025-03-11", "13:50", "16","N",1,4),
("2025-03-11", "19:10", "16","N",1,4),
("2025-03-11", "10:10", "20","Y",1,5);

# 회원가입하는 쿼리. 아이디 : abc123, 비번 : abc123, 사용자
INSERT INTO `MEMBER`(ME_ID,ME_PW) VALUE("abc123","abc123"); 


SELECT * FROM cgv.schedule;
# abc 회원이 1번 스케쥴(미키 17, 1관 3월 11일 16:50)의 예약 가능한 좌석 A1, A2를 예매했을 때 필요한 쿼리
# 성인 1, 청소년 1
# 예매 테이블에 추가하는 쿼리
INSERT INTO TICKET(TI_ADULT, TI_TEEN, TI_PRICE, TI_ME_NUM, TI_SD_NUM) VALUE
(1, 1, 27000, 1, 1);
# 예매 리스트 테이블에 추가하는 쿼리
INSERT INTO TICKET_LIST(TL_TI_NUM, TL_SE_NUM) VALUE(1,1),(1,2);
# 스케쥴에 예매 가능 좌석수를 변경
UPDATE `SCHEDULE` SET SD_POS_SEAT= SD_POS_SEAT-2 WHERE SD_NUM = 1;


# abc 회원이 1번 스케쥴(미키 17, 4관 3월 11일 19:10)의 예약 가능한 좌석 A1, A2를 예매했을 때 필요한 쿼리
INSERT INTO TICKET(TI_ADULT, TI_TEEN, TI_PRICE, TI_ME_NUM, TI_SD_NUM) VALUE
(1, 1, 27000, 1, 1);
INSERT INTO TICKET_LIST(TL_TI_NUM, TL_SE_NUM) VALUE(2,38),(2,39);
# 스케쥴에 예매 가능 좌석수를 변경
UPDATE `SCHEDULE` SET SD_POS_SEAT= SD_POS_SEAT-2 WHERE SD_NUM = 1;

# abc 회원이 2번 스케쥴(미키 17, 3관 3월 11일 11:50)의 예약 가능한 좌석 A1, A2를 예매했을 때 필요한 쿼리
INSERT INTO TICKET(TI_ADULT, TI_TEEN, TI_PRICE, TI_ME_NUM, TI_SD_NUM) VALUE
(1, 1, 27000, 1, 2);
INSERT INTO TICKET_LIST(TL_TI_NUM, TL_SE_NUM) VALUE(3,38),(3,39);
# 스케쥴에 예매 가능 좌석수를 변경
UPDATE `SCHEDULE` SET SD_POS_SEAT= SD_POS_SEAT-2 WHERE SD_NUM = 2;


# abc 회원이 2번 스케쥴(미키 17, 4관 3월 11일 19:10)의 예약 가능한 좌석 A3, A4를 예매했을 때 필요한 쿼리
INSERT INTO TICKET(TI_ADULT, TI_TEEN, TI_PRICE, TI_ME_NUM, TI_SD_NUM) VALUE
(1, 1, 27000, 1, 2);
INSERT INTO TICKET_LIST(TL_TI_NUM, TL_SE_NUM) VALUE(4,40),(4,41);
# 스케쥴에 예매 가능 좌석수를 변경
UPDATE `SCHEDULE` SET SD_POS_SEAT= SD_POS_SEAT-2 WHERE SD_NUM = 2;

# abc123 회원이 2번 스케쥴에 예약했던 좌석 A3, A4를 취소했을 때 필요한 쿼리
UPDATE TICKET SET TI_STATE="취소" WHERE TI_NUM =4;
# 스케쥴에 예매 가능 좌석수를 변경
UPDATE `SCHEDULE` SET SD_POS_SEAT= SD_POS_SEAT+2 WHERE SD_NUM = 2;

